; domain
(define (domain exploration)
    (:requirements :strips :typing :equality :action-costs)
    
    (:types
        robot location - object
    )
    
    (:predicates
        (at ?r - robot ?l - location)
        (explored ?l - location)
        (adjacent ?l1 - location ?l2 - location)
        (can-traverse ?r - robot ?l - location)
        (can-observe ?r - robot ?l - location)
    )
    
    (:functions
        (total-cost)
        (traverse-cost ?r - robot ?l - location)
    )
    
    (:action move
        :parameters (?r - robot ?from - location ?to - location)
        :precondition (and
            (at ?r ?from)
            (adjacent ?from ?to)
            (can-traverse ?r ?to)
        )
        :effect (and
            (not (at ?r ?from))
            (at ?r ?to)
            (increase (total-cost) (traverse-cost ?r ?to))
        )
    )
    
    (:action observe
        :parameters (?r - robot ?l - location)
        :precondition (and
            (at ?r ?l)
            (can-observe ?r ?l)
        )
        :effect (explored ?l)
    )
)

; problem
(define (problem exploration-generated)
    (:domain exploration)
    
    (:objects
        vehB vehG - robot
        l11 l12 l13 l21 l22 l23 l31 l32 l33 - location
    )
    
    (:init
        ;; Robot starting positions
        (at vehB l11)
        (at vehG l11)

        ;; Traversability and costs (based on terrain types)
        (can-traverse vehB l11)
        (= (traverse-cost vehB l11) 1)
        (can-traverse vehG l11)
        (= (traverse-cost vehG l11) 1)
        (can-traverse vehB l12)
        (= (traverse-cost vehB l12) 1)
        (can-traverse vehB l13)
        (= (traverse-cost vehB l13) 1)
        (can-traverse vehG l13)
        (= (traverse-cost vehG l13) 1)
        (can-traverse vehB l21)
        (= (traverse-cost vehB l21) 1)
        (can-traverse vehG l21)
        (= (traverse-cost vehG l21) 1)
        (can-traverse vehB l22)
        (= (traverse-cost vehB l22) 5)
        (can-traverse vehG l22)
        (= (traverse-cost vehG l22) 5)
        (can-traverse vehB l23)
        (= (traverse-cost vehB l23) 1)
        (can-traverse vehG l23)
        (= (traverse-cost vehG l23) 1)
        (can-traverse vehB l31)
        (= (traverse-cost vehB l31) 1)
        (can-traverse vehG l31)
        (= (traverse-cost vehG l31) 1)
        (can-traverse vehB l32)
        (= (traverse-cost vehB l32) 1)
        (can-traverse vehG l32)
        (= (traverse-cost vehG l32) 1)
        (can-traverse vehB l33)
        (= (traverse-cost vehB l33) 1)
        (can-traverse vehG l33)
        (= (traverse-cost vehG l33) 1)

        ;; Observation capabilities (based on observation types)
        (can-observe vehB l11)
        (can-observe vehG l11)
        (can-observe vehB l12)
        (can-observe vehG l12)
        (can-observe vehB l13)
        (can-observe vehB l21)
        (can-observe vehG l21)
        (can-observe vehB l22)
        (can-observe vehG l22)
        (can-observe vehB l23)
        (can-observe vehG l23)
        (can-observe vehB l31)
        (can-observe vehG l31)
        (can-observe vehG l32)
        (can-observe vehB l33)
        (can-observe vehG l33)

        ;; Grid adjacency
        (adjacent l11 l12) (adjacent l12 l11)
        (adjacent l11 l21) (adjacent l21 l11)
        (adjacent l12 l13) (adjacent l13 l12)
        (adjacent l12 l22) (adjacent l22 l12)
        (adjacent l13 l23) (adjacent l23 l13)
        (adjacent l21 l22) (adjacent l22 l21)
        (adjacent l21 l31) (adjacent l31 l21)
        (adjacent l22 l23) (adjacent l23 l22)
        (adjacent l22 l32) (adjacent l32 l22)
        (adjacent l23 l33) (adjacent l33 l23)
        (adjacent l31 l32) (adjacent l32 l31)
        (adjacent l32 l33) (adjacent l33 l32)

        (= (total-cost) 0)
    )
    
    (:goal (and
        ;; All locations explored
        (explored l11) (explored l12) (explored l13)
        (explored l21) (explored l22) (explored l23)
        (explored l31) (explored l32) (explored l33)
        ;; Robot goal positions
        (at vehB l33)
        (at vehG l33)
    ))
    
    (:metric minimize (total-cost))
)

; plan
1. (move vehg l11 l21)
   deleted: (at vehg l11)
   added: (at vehg l21)
   goals met: 0 of 11
2. (move vehg l21 l22)
   deleted: (at vehg l21)
   added: (at vehg l22)
   goals met: 0 of 11
3. (observe vehg l22)
   added: (explored l22)
   goals met: 1 of 11
4. (move vehg l22 l32)
   deleted: (at vehg l22)
   added: (at vehg l32)
   goals met: 1 of 11
5. (observe vehg l32)
   added: (explored l32)
   goals met: 2 of 11
6. (observe vehb l11)
   added: (explored l11)
   goals met: 3 of 11
7. (move vehg l32 l33)
   deleted: (at vehg l32)
   added: (at vehg l33)
   goals met: 4 of 11
8. (move vehb l11 l21)
   deleted: (at vehb l11)
   added: (at vehb l21)
   goals met: 4 of 11
9. (observe vehb l21)
   added: (explored l21)
   goals met: 5 of 11
10. (move vehb l21 l31)
   deleted: (at vehb l21)
   added: (at vehb l31)
   goals met: 5 of 11
11. (observe vehb l31)
   added: (explored l31)
   goals met: 6 of 11
12. (move vehb l31 l32)
   deleted: (at vehb l31)
   added: (at vehb l32)
   goals met: 6 of 11
13. (move vehb l32 l33)
   deleted: (at vehb l32)
   added: (at vehb l33)
   goals met: 7 of 11
14. (move vehb l33 l23)
   deleted: (at vehb l33)
   added: (at vehb l23)
   goals met: 6 of 11
15. (move vehb l23 l13)
   deleted: (at vehb l23)
   added: (at vehb l13)
   goals met: 6 of 11
16. (move vehb l13 l12)
   deleted: (at vehb l13)
   added: (at vehb l12)
   goals met: 6 of 11
17. (observe vehb l12)
   added: (explored l12)
   goals met: 7 of 11
18. (move vehb l12 l13)
   deleted: (at vehb l12)
   added: (at vehb l13)
   goals met: 7 of 11
19. (observe vehb l13)
   added: (explored l13)
   goals met: 8 of 11
20. (move vehb l13 l23)
   deleted: (at vehb l13)
   added: (at vehb l23)
   goals met: 8 of 11
21. (observe vehb l23)
   added: (explored l23)
   goals met: 9 of 11
22. (move vehb l23 l33)
   deleted: (at vehb l23)
   added: (at vehb l33)
   goals met: 10 of 11
23. (observe vehg l33)
   added: (explored l33)
   goals met: 11 of 11
